// setTimeout(() => {
//   console.log("a");
//   setTimeout(() => {
//     console.log("b");
//   }, 1000);
// }, 1500);
// //  이구조....for문 구구단에서 본적있다.

// setTimeout(() => {
//   console.log("c");
// }, 500);

// 하드웨어란/ 실제로 만질수있는 물건으로, 램, 메모리, ssd, 쿨러, 파워소플라인 등등을 하드웨어라고 한다.
//cpu - 하드웨어 안에 있는걸로 선입선출하는것이다. 내가 코드 요청을 보내면 선입선출로 된다.
//소프트웨어/ 만질수없고 하드웨어 안에 설치된걸로 내가 이용하기 위한것이 소프트웨어이다.

//a > b > c로 찍히게 하고싶으면 어떻게 할까? 프로미스 안 써도 된다.
// ->  a타임아웃 안에 b타임아웃을 넣으면 된다. c는 b
//단점이 있다. c까지 찍히는데까지 시간이 걸린다. 병렬처리와 하나하나 처리 할때..... 콜백안에 콜백 등등...깊어질때 콜백헬,,콜백지옥이라 한다. 동기형식의 가독성을 올려보고자 나온게 promise다

//재기함수? - 내가 나를 호출하는 함수.

//위 콜백지옥을 회피하기 위해서 프로미스 기반으로 변경.

//함수정의식, 함수 표현식 . 차이가 조금 있다.

function Test() {
  // 함수 정의식
}

const test2 = () => {
  //함수 표현식
};

const timer = (str) => {
  return new Promise((resolve, reject) => {
    setTimeout(() => {
      console.log(str);
      //셋타임아웃은 기본적으로 비동기 성질이라 시간을 안적어도 동기처리 다음에 뜬다.
      if (
        str === "A" ||
        str === "B" ||
        str === "C"
        //가장 첫번째로 참이되는경우가 많은걸 우선순위로 적는게 좋다. 빈도수가 99%되는애를 뒤로 넣어놓으면 비교처리를 3번해야한다. 근데 가장 앞에 적으면 99%는 처리 한번만 하고 끝난다. 참이되는 빈도수가 높은걸 처음으로 적는게 프로그램...어쩌고.암튼 좋음
      ) {
        resolve({ code: "허용", word: str });
        // 객체로 셋팅한거다. 리졸브가 성공패턴으로 왔을때 반환해주는 값이다. 여기서 리졸브(파라미터)가 아닌 리졸브(아규먼트)를 적는다.
      } else {
        reject(new Error("허용하지 않는 문자가 입력 됐다."));
      }
    }, 2000);
  });
  //성공했을때의 함수와 실패했을때의 함수를 매개변수자리에 자동으로 넣어준다.
};

timer("A")
  // PROMISE 호출하니 바로 값을받아 실행.... pending으로 만들어둬야 한다.?
  //대기상태의 프로미스를 반환하면...리젝트인지 리졸브인지 기다리다가 성공한거를 위 프로미스객체가 알려주면 then으로 들어간다.
  .then((result) => {
    //내가 요청보낸 결과가 돌아온다 - result(파라미터임)
    //resolve일때 실행되는 코드
    console.log(result.code, result.word);
    return timer("B"); //동기처리를 하기 위한 방법, 프로미스 객체로 만들어서 반환하고있는것. 그리고 그 다음 정의된 then으로 들어가서 처리를 이어간다.
    //실행자체는 then안에서 한다.
  })
  .then((result) => {
    console.log(result.code, result.word);
    return timer("C");
  })
  .then((result) => {
    console.log(result.code, result.word);
    // 프로미스 객체의 비동기처리를 동기처리로 만드려면 이렇게 만드면 된다. 계속 then을 연결해야한다.
    //그 다음 .then 안에서 timer("B")를 실행하고 또 2초 대기 후 출력 (누적 4초 소요)

    //그 다음 .then 안에서 timer("C")를 실행하고 또 2초 대기 후 출력 (누적 6초 소요)
  })
  .catch((error) => {
    //reject일때 실행 되는 코드 작성
    console.log(error.message);
  })
  .finally(() => {
    //resolve/ reject 결과 불문 무조건 실행
    console.log("파이널리");
  });
//체이닝 메소드를 걸어둔다. 성공을해서 리젝트상태로 반환이 되면 then으로 들어가고 reject면 catch로 들어간다. finally는 여부 상관없이 무조건 실행

//체이닝 메소드를 사용하는동안만 pending을 보장받는것이다.

// B, C조건 추가 | <버티컬 바라고 함
